adpyke.codesnap
aminer.codegeex
christian-kohler.path-intellisense
codeadamca.livecode
codeinchinese.englishchinesedictionary
dracula-theme.theme-dracula
drcika.apc-extension
esbenp.prettier-vscode
formulahendry.auto-rename-tag
github.github-vscode-theme
hnw.vscode-auto-open-markdown-preview
illixion.vscode-vibrancy-continued
kisstkondoros.vscode-gutter-preview
mhutchie.git-graph
ms-ceintl.vscode-language-pack-zh-hans
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
pkief.material-icon-theme
quicktype.quicktype
saoudrizwan.claude-dev
shalldie.background
shaobeichen.gradient-theme
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
zhongjun.woodfish-theme
zhuangtongfa.material-theme
